---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.CouldNotAcquireAssemblyViews
source: html/5d8a541a-5224-06de-b2e9-ef51e51a4dfb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.CouldNotAcquireAssemblyViews Property

The assembly instance could not acquire the assembly views.

## Syntax (C#)
```csharp
public static FailureDefinitionId CouldNotAcquireAssemblyViews { get; }
```